configuration/src/ChartsOfCharacteristicTypes/ВидыДополнительныхРеквизитов/ВидыДополнительныхРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыДополнительныхРеквизитов</name>
  <type>
    <types>CatalogRef.ДополнительныеОписанияОбъектов</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ВидыЗадач</types>
    <types>Boolean</types>
    <types>CatalogRef.НаправленияРазработки</types>
    <types>DocumentRef.Задача</types>
    <types>String</types>
    <types>CatalogRef.Услуги</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.ДоступныеЗначенияРеквизитов</types>
    <types>CatalogRef.СистемыУчета</types>
    <types>CatalogRef.НазначенияЗадач</types>
    <numberQualifiers>
      <precision>12</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>500</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НастройкиОповещенийУведомлений</name>
      <description>Настройки оповещений уведомлений</description>
      <code>000000061</code>
      </content>
      </content>
    </items>
    <items>
      <name>MarkdownОписаниеЗафиксировано</name>
      <description>Markdown описание зафиксировано</description>
      <code>000000112</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>АвтоматическоеИзменениеСтатусаПослеОбновления</name>
      <description>Автоматическое изменение статуса после обновления</description>
      <code>000000019</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>АвтоматическоеНазначениеФилиала</name>
      <description>Автоматическое назначение филиала</description>
      <code>000000091</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ДатаПоследнегоИзмененияОбъекта</name>
      <description>Дата последнего изменения объекта</description>
      <code>000000001</code>
      <type>
        <types>Date</types>
      </type>
    </items>
    <items>
      <name>ДатаПоследнегоИзмененияПодчиненныхОбъектов</name>
      <description>Дата последнего изменения подчиненных объектов</description>
      <code>000000002</code>
      <type>
        <types>Date</types>
      </type>
    </items>
    <items>
      <name>ДатаПоследнейОтправкиОповещенийОЗанесенииТрудозатрат</name>
      <description>Дата последней отправки оповещений о занесении трудозатрат</description>
      <code>000000016</code>
      <type>
        <types>Date</types>
      </type>
    </items>
    <items>
      <name>ЗадачаНаАвтотесты</name>
      <description>Задача на автотесты</description>
      <code>000000006</code>
      <type>
        <types>DocumentRef.Задача</types>
      </type>
    </items>
    <items>
      <name>ЗадачаНаДокументацию</name>
      <description>Задача на документацию</description>
      <code>000000007</code>
      <type>
        <types>DocumentRef.Задача</types>
      </type>
    </items>
    <items>
      <name>ЗапрещеноИзменениеОписанияЗаявки</name>
      <description>Запрещено изменение описания</description>
      <code>000000085</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>КоличествоПодчиненныхЗадач</name>
      <description>Количество подчиненных задач</description>
      <code>000000092</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ОписаниеФорматаHTML</name>
      <description>Описание формата HTML</description>
      <code>000000096</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>Куратор</name>
      <description>Ответственный</description>
      <code>000000101</code>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
    <items>
      <name>ПлановоеВремяТестирования</name>
      <description>Плановое время тестирования</description>
      <code>000000003</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ПлановыеТрудозатраты</name>
      <description>Плановые трудозатраты</description>
      <code>000000087</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ПримечаниеРазработчиков</name>
      <description>Примечание разработчиков</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.ДополнительныеОписанияОбъектов</types>
      </type>
    </items>
    <items>
      <name>ПримечаниеТестировщиков</name>
      <description>Примечание тестировщиков</description>
      <code>000000009</code>
      <type>
        <types>CatalogRef.ДополнительныеОписанияОбъектов</types>
      </type>
    </items>
    <items>
      <name>РевьюерОбъекта</name>
      <description>Ревьюер объекта</description>
      <code>000000080</code>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
    <items>
      <name>РезультатПоследнегоТестирования</name>
      <description>Результат последнего тестирования</description>
      <code>000000008</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>СмещениеВремени</name>
      <description>Смещение времени</description>
      <code>000000093</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>СозданЧерезБыстроеСозданиеЗадачи</name>
      <description>Создан через быстрое создание задачи</description>
      <code>000000076</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>СозданЧерезГрупповоеВнесениеТрудозатрат</name>
      <description>Создан через групповое внесение трудозатрат</description>
      <code>000000072</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>СрокАктуальностиЗаявкиВСтатусеНаДоработку</name>
      <description>Срок актуальности заявки в статусе &quot;На доработку&quot;</description>
      <code>000000059</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ФактическаяСтоимостьРабот</name>
      <description>Стоимость работ (Общие)</description>
      <code>000000094</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ФактическиеТрудозатратыЗадачи</name>
      <description>Фактические трудозатраты (Задачи)</description>
      <code>000000089</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ФактическиеТрудозатратыЗаявки</name>
      <description>Фактические трудозатраты (Заявки)</description>
      <code>000000090</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ФактическиеТрудозатраты</name>
      <description>Фактические трудозатраты (Общие)</description>
      <code>000000088</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ЦелеваяЗаявка</name>
      <description>Целевая заявка</description>
      <code>000000107</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ЧекЛистТестирования</name>
      <description>Чек лист тестирования</description>
      <code>000000005</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <comment>Признак необходимости проверки заполненности значения характеристики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСледования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проверяемый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеВИнтерфейсе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеВФормеОбъекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИспользоватьВОбъектах</name>
    <attributes>
      <name>Тип</name>
      <comment>Хранит пустую ссылку на тот объект, в котором используется этот вид реквизита</comment>
      <type>
        <types>DefinedType.ВладелецДополнительныхРеквизитов</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <comment>Описание типа для администраторов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <comment>Если пустая ссылка - доступен всем, иначе только указанным филиалам</comment>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

configuration/src/InformationRegisters/ЗначенияДополнительныхРеквизитовОбъектов/ЗначенияДополнительныхРеквизитовОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияДополнительныхРеквизитовОбъектов</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ВидыДополнительныхРеквизитов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ВладелецДополнительныхРеквизитов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыДополнительныхРеквизитов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/ChartsOfCharacteristicTypes/ВидыДополнительныхРеквизитов/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда
		РезультатПроверки = ВыполнитьПроверку();
		
		Если РезультатПроверки.Используется Тогда
			Если РезультатПроверки.ИспользуетсяВУдаленныхТипах Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено удаление типа, в котором уже используется этот вид реквизита");
			КонецЕсли;
			
			Если ДополнительныеСвойства.Свойство("ИзменилсяТипЗначения") Тогда
				Если ДополнительныеСвойства.ИзменилсяТипЗначения Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено изменять тип значения дополнительного реквизита, если он уже используется.", Ссылка, "ТипЗначения", "Объект.ТипЗначения", Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

// Проверяет используется ли дополнительный реквизит, отдельный поиск использования в удаленных типах,
// если они есть, а также наличие подчиненных элементов в справочнике ДоступныеЗначенияРеквизитов
// 
// Возвращаемое значение:
//   - Структура
//		* ИспользуетсяВУдаленныхТипах	- Булево	- использование данного дополнительного реквизита в объектах, тип которых удален из списка доступных типов
//		* ЕстьДоступныеЗначения			- Булево	- наличие подчиненных элементов в справочнике ДоступныеЗначенияРеквизитов
//		* Используется					- Булево	- используется ли вообще данный дополнительный реквизит
//
Функция ВыполнитьПроверку()
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Ссылка КАК Ссылка,
	|	Таблица.Тип КАК Тип,
	|	Таблица.Филиал КАК Филиал
	|ПОМЕСТИТЬ ТипыТекущегоОбъекта
	|ИЗ
	|	&ТаблицаТипов КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИспользуемыеОбъекты.Ссылка КАК Ссылка,
	|	ИспользуемыеОбъекты.Тип КАК Тип
	|ПОМЕСТИТЬ УдаленныеТипы
	|ИЗ
	|	ПланВидовХарактеристик.ВидыДополнительныхРеквизитов.ИспользоватьВОбъектах КАК ИспользуемыеОбъекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТипыТекущегоОбъекта КАК ТипыТекущегоОбъекта
	|		ПО ИспользуемыеОбъекты.Ссылка = ТипыТекущегоОбъекта.Ссылка
	|			И ИспользуемыеОбъекты.Тип = ТипыТекущегоОбъекта.Тип
	|			И ИспользуемыеОбъекты.Филиал = ТипыТекущегоОбъекта.Филиал
	|ГДЕ
	|	ИспользуемыеОбъекты.Ссылка = &Ссылка
	|	И ТипыТекущегоОбъекта.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК Используется
	|ИЗ
	|	РегистрСведений.ЗначенияДополнительныхРеквизитовОбъектов КАК ЗначенияДополнительныхРеквизитов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УдаленныеТипы КАК УдаленныеТипы
	|		ПО ЗначенияДополнительныхРеквизитов.Реквизит = УдаленныеТипы.Ссылка
	|			И (ТИПЗНАЧЕНИЯ(ЗначенияДополнительныхРеквизитов.Объект) = ТИПЗНАЧЕНИЯ(УдаленныеТипы.Тип))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК Используется
	|ИЗ
	|	РегистрСведений.ЗначенияДополнительныхРеквизитовОбъектов КАК ЗначенияДополнительныхРеквизитовОбъектов
	|ГДЕ
	|	ЗначенияДополнительныхРеквизитовОбъектов.Реквизит = &Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаТипов", ИспользоватьВОбъектах.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Пакеты = Запрос.ВыполнитьПакет();
	
	Результат.Вставить("ИспользуетсяВУдаленныхТипах", (НЕ Пакеты.Получить(2).Пустой()));
	Результат.Вставить("Используется", (НЕ Пакеты.Получить(3).Пустой()));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
